---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadPowerParam
source: html/3cf71958-5d6c-5484-90af-e7e020886874.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalloadPowerParam Property

"Power Total Connected"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalloadPowerParam { get; }
```